run/rhoVoF/rotateSubstrate/reducedCaseCHTtest/common/constant/fluid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// direct copy from TPF, might need edits to limits and to type, away from phase?

//thermoType
//{
//	type	


phases (water air);

pMin            pMin [ 1 -1 -2 0 0 0 0 ] 10000;

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.0;//0.0089004;

TMin            TMin [0 0 0 1 0 0 0] 60.0;

TMax            TMax [0 0 0 1 0 0 0] 500.0;

water
{
    type pureMovingPhaseModel;	//luis: pureStaticPhaseModel
}

air
{
    type pureMovingPhaseModel;	//luis: pureStaticPhaseModel
}

surfaceForces
{
  sigma 0.0;
  surfaceTensionForceModel gradAlpha;
  accelerationForceModel gravity;
  deltaFunctionModel alphaCSF;
}


// ************************************************************************* //
