run/rhoVoF/rotateSubstrate/reducedCaseCHTtest/common/constant/fluid/thermophysicalProperties.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState Boussinesq;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   18.0;
    }
    equationOfState
    {
        //R           1024;
        rho0        999.94;	//958.4;
        T0          275.15;	//373;
        beta        6.9e-4;	//luis: current value from Scheufler TPF, probably needs to be adapted to match our water...
    }
    thermodynamics
    {
        Cp          4210;	//4216.0;
        Hf          0;
    }
    transport
    {
        mu          0.001674;	//0.00028176;
        Pr          4.9;	//1.7703430104321904;		//luis: probably not correct value as well...   jetzt schon
        //Pr          0.17703430104321904; 
    }
}


// ************************************************************************* //
