run/rhoVoF/rotateSubstrate/reducedCaseCHTtest/common/0.orig/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//luis: direct copy from Scheufler CoffeePot TPF


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{

//    Sym
//    {
//        type fixedFluxPressure;
//    }

    fluidBottom	//fluid_to_solid
    {
        type fixedFluxPressure;
    }

    fluidTop //What does he mean with Mantle? Plate? Drop? Air???-> Mantle and Top boundary of the Domain!
    {
	type            totalPressure;	//zeroGradient; //fixedValue;
	p0		uniform 1e5;
	value           uniform 1e5;
    }

    fluidMantle
    {
	type	zeroGradient;
    }


//    top
//    {
//        type totalPressure;
//        p0 uniform 1e5;
//        value uniform 1e5;
//    }

//    bottomEmptyFaces
//    {
//        type empty;
//    }

//    topEmptyFaces
//    {
//        type empty;
//    }
}

// ************************************************************************* //
