run/rhoVoF/rotateSubstrate/reducedCaseCHTtest/common/0.orig/solid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//luis: direct copy of Scheufler TPF


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
//    Sym
//    {
//        type fixedFluxPressure;
//    }

    solidBottom
    {
        type fixedFluxPressure;
    }

    solidMantle
    {
        type fixedFluxPressure;
    }

    solidTop		//solid_to_fluid
    {
        type fixedFluxPressure;
    }

//    bottomEmptyFaces
//    {
//        type empty;
//    }

//    topEmptyFaces
//    {
//        type empty;
//    }
}

// ************************************************************************* //
