run/rhoVoF/rotateSubstrate/reducedCaseCHTtest/common/system/fluid/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//Direct copy from Jun
//Not verified or edited, basically

// Preload any required fields (optional)
readFields      ( U alpha.water);

expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

        constants
        {
            limit 1e-6;
        }

/*        variables
        (
            "radius = 0.001"
        );*/

        fieldMask
        #{
          alpha.water > $[(scalar)constants.limit] //I think this one just calles the the value of limit which is defined in constants whic is a scalar, and checks which cells have a value of alpha.water which is below this threshold
        #};

        expression
        #{
           vector (0.0, 0.0, -3.1)
        #};
    }
);


// ************************************************************************* //
